samhodge-tokgan/Hastur/src/Sam3TrackerPlugin.cpp
// Copyright the Hastur authors.
// SPDX-License-Identifier: LicenseRef-SAM-License
//
// SAM 3 Tracker OpenFX plugin — the THIRD plugin in the Hastur bundle (Phase
// 5e-ii). It wraps the integrated Sam3MultiTracker engine (src/Sam3MultiTracker.h)
// in an OFX node whose PRODUCT is the external-tracks sidecar Hastur's SAM 3D Body
// node consumes downstream (src/ExternalTracks.h) — replacing the Python pre-pass.
//
// Data flow:
//
//   Source (whole image sequence, TEMPORAL clip access)
//        |
//        |  render() FIRST call -> whole-clip pre-pass (blocking, progress-visible):
//        |    per frame: BeginFrame -> Detect -> associate -> Seed/Propagate
//        |    forward pass (seed -> end), then backward pass (seed -> start)
//        |    (mirrors skylab's validate_bidir.cpp bidirectional driver)
//        v
//   tracksOutputDir/tracks.txt + masks/<frame:04d>_<id:02d>.msk   <- the product
//        |
//   Output  <- Source passed through UNCHANGED (the node emits no new image)
//
// This node is NOT multi-plane. It is stateless per-frame apart from a done-flag
// guard: it caches its whole-clip result (writes the sidecar once) and recomputes
// only when a param / clip / frame-range change invalidates the signature.
//
// Compile-only in this phase (Phase 5e-ii): a real host smoke against the ONNX
// graphs is the separate Phase 5e-ii-b (on the CUDA render host). On ANY failure
// the node degrades gracefully — it always passes Source through and never crashes
// the host.

#include <algorithm>
#include <cmath>
#include <cstdint>
#include <cstdio>
#include <cstdlib>
#include <cstring>
#include <fstream>
#include <memory>
#include <mutex>
#include <string>
#include <unordered_map>
#include <vector>

#include "ofxsImageEffect.h"
#include "ModelBytes.h"
#include "ofxsProcessing.H"

#include "Register.h"

#if HASTUR_WITH_ONNX
#include <filesystem>
#ifdef _WIN32
#include <windows.h>
#else
#include <dlfcn.h>
#endif
#include "OrtSessionManager.h"  // hastur::Ep, hastur::ComputeUnits
#include "Sam3MultiTracker.h"
#endif

#define kT3PluginName "SAM 3 Tracker"
#define kT3PluginGrouping "Tokgan"
#define kT3PluginDescription                                                   \
  "Run the SAM 3 video tracker over the WHOLE clip and write the external-"     \
  "tracks sidecar (tracks.txt + per-frame .msk masks) that Hastur's SAM 3D "    \
  "Body node consumes downstream. Detect + associate + bidirectional propagate " \
  "from a mid-clip max-visibility seed frame; Output passes Source through "     \
  "unchanged (the node's product is the sidecar file, not a new image)."
#define kT3PluginIdentifier "com.tokgan.Sam3Tracker"
#define kT3PluginVersionMajor 0
#define kT3PluginVersionMinor 1

// Param names.
#define kT3ParamModelDir "modelDir"
#define kT3ParamTracksOutputDir "tracksOutputDir"
#define kT3ParamSeedFrame "seedFrame"
#define kT3ParamBidirectional "bidirectional"
#define kT3ParamScoreThresh "scoreThresh"
#define kT3ParamNmsIou "nmsIou"
#define kT3ParamComputeUnits "computeUnits"

////////////////////////////////////////////////////////////////////////////////
// Passthrough copy processor (Source -> Output, verbatim). Mirrors HasturPlugin's
// CopyProcessor; the node emits no new image, so render always copies Source.
namespace {

class T3CopyBase : public OFX::ImageProcessor {
 protected:
  OFX::Image* _srcImg;
 public:
  explicit T3CopyBase(OFX::ImageEffect& e) : OFX::ImageProcessor(e), _srcImg(nullptr) {}
  void setSrcImg(OFX::Image* v) { _srcImg = v; }
};

template <class PIX, int nComponents>
class T3CopyProcessor : public T3CopyBase {
 public:
  explicit T3CopyProcessor(OFX::ImageEffect& e) : T3CopyBase(e) {}
  void multiThreadProcessImages(OfxRectI w) override {
    for (int y = w.y1; y < w.y2; ++y) {
      if (_effect.abort()) break;
      PIX* dst = static_cast<PIX*>(_dstImg->getPixelAddress(w.x1, y));
      if (!dst) continue;
      for (int x = w.x1; x < w.x2; ++x) {
        const PIX* src =
            static_cast<const PIX*>(_srcImg ? _srcImg->getPixelAddress(x, y) : nullptr);
        if (src)
          for (int c = 0; c < nComponents; ++c) dst[c] = src[c];
        else
          for (int c = 0; c < nComponents; ++c) dst[c] = PIX(0);
        dst += nComponents;
      }
    }
  }
};

#if HASTUR_WITH_ONNX

// Directory holding this .ofx binary (Contents/<arch>), resolved from a symbol
// inside the loaded module — same approach as HasturPlugin's PluginBinaryDir.
std::string T3PluginBinaryDir() {
#ifdef _WIN32
  HMODULE h = nullptr;
  GetModuleHandleExA(GET_MODULE_HANDLE_EX_FLAG_FROM_ADDRESS |
                         GET_MODULE_HANDLE_EX_FLAG_UNCHANGED_REFCOUNT,
                     reinterpret_cast<LPCSTR>(&T3PluginBinaryDir), &h);
  char buf[MAX_PATH] = {0};
  GetModuleFileNameA(h, buf, MAX_PATH);
  std::string p(buf);
  size_t slash = p.find_last_of("\\/");
  return slash == std::string::npos ? std::string() : p.substr(0, slash);
#else
  Dl_info info;
  if (dladdr(reinterpret_cast<void*>(&T3PluginBinaryDir), &info) && info.dli_fname) {
    std::string p(info.dli_fname);
    size_t slash = p.find_last_of('/');
    return slash == std::string::npos ? std::string() : p.substr(0, slash);
  }
  return {};
#endif
}

// The bundle's sibling Contents/Resources dir (where runtime model assets ship).
std::string T3BundleResourceDir() {
  std::string bin = T3PluginBinaryDir();
  if (bin.empty()) return {};
  size_t slash = bin.find_last_of("\\/");
  if (slash == std::string::npos) return {};
  return (std::filesystem::path(bin.substr(0, slash)) / "Resources").string();
}

// Resolve the directory that holds the 5 ONNX graphs (G1..G5) + the .npy
// constants. Candidates, in order: the param dir, each $HASTUR_MODEL_DIR entry,
// then the bundle Resources dir. The first that actually contains G1.onnx wins;
// otherwise the param dir (or the first non-empty candidate) is returned so the
// engine constructor throws a clear "cannot open" and we fall back to passthrough.
std::string T3ResolveModelDir(const std::string& param_dir) {
  namespace fs = std::filesystem;
#ifdef _WIN32
  const char kSep = ';';
#else
  const char kSep = ':';
#endif
  std::vector<std::string> cands;
  if (!param_dir.empty()) cands.push_back(param_dir);
  if (const char* env = std::getenv("HASTUR_MODEL_DIR")) {
    std::string s(env);
    size_t i = 0;
    while (i <= s.size()) {
      size_t j = s.find(kSep, i);
      if (j == std::string::npos) j = s.size();
      if (j > i) cands.push_back(s.substr(i, j - i));
      i = j + 1;
    }
  }
  const std::string res = T3BundleResourceDir();
  if (!res.empty()) cands.push_back(res);

  std::error_code ec;
  for (const std::string& d : cands)
    // ModelExists, not fs::exists: a sealed tracker tree has no file called
    // G1.onnx, so this probe would reject the very directory it is looking for.
    if (hastur::ModelExists((fs::path(d) / "G1.onnx").string())) return d;
  if (!cands.empty()) return cands.front();
  return param_dir;
}

