samhodge-tokgan/Hastur/src/Sam3TrackerPlugin.cpp
// Build the engine's MultiPaths (absolute file paths) from a resolved model dir.
// File names match the exported SAM 3 asset set the engine + validate driver use.
// Every file the tracker group needs. A sealed tree has no readable listing —
// the names on disk are HMACs — so materialisation has to be told. The .data
// sidecars are the reason this group cannot be loaded from buffers at all.
const std::vector<std::string>& Sam3TrackerFiles() {
  static const std::vector<std::string> f = {
      "G1.onnx", "G1.onnx.data", "G2.onnx", "G2.onnx.data",
      "G3.onnx", "G3.onnx.data", "G4.onnx", "G4.onnx.data",
      "G5.onnx", "G5.onnx.data",
      "const_maskmem_tpos_enc.npy", "const_no_mem_embed.npy",
      "const_objptr_tpos_proj_w.npy", "const_objptr_tpos_proj_b.npy",
      "const_lang_feats_person.npy", "const_lang_mask_person.npy",
  };
  return f;
}

hastur::MultiPaths T3BuildPaths(const std::string& dir) {
  // Sealed trees decrypt into a RAM-backed directory first; a plaintext tree
  // comes back unchanged. Every path below is built off the result, so nothing
  // downstream needs to know which it got.
  // No materialise step. The ONNX graphs load from memory with their
  // .onnx.data sidecars registered via AddExternalInitializersFromFilesInMemory
  // (#68), and the .npy constants now load from memory too -- so nothing here
  // needs a file to exist on disk. Paths below are names the SealedTree
  // resolves, not filesystem locations.
  const std::string resolved = dir;
  namespace fs = std::filesystem;
  const fs::path d(resolved);
  hastur::MultiPaths p;
  p.g1 = (d / "G1.onnx").string();
  p.g2 = (d / "G2.onnx").string();
  p.g3 = (d / "G3.onnx").string();
  p.g4 = (d / "G4.onnx").string();
  p.g5 = (d / "G5.onnx").string();
  p.tpos = (d / "const_maskmem_tpos_enc.npy").string();
  p.no_mem = (d / "const_no_mem_embed.npy").string();
  p.proj_w = (d / "const_objptr_tpos_proj_w.npy").string();
  p.proj_b = (d / "const_objptr_tpos_proj_b.npy").string();
  p.lang_feats = (d / "const_lang_feats_person.npy").string();
  p.lang_mask = (d / "const_lang_mask_person.npy").string();
  return p;
}

hastur::ComputeUnits T3ChoiceToUnits(int choice) {
  switch (choice) {
    case 0: return hastur::ComputeUnits::All;
    case 1: return hastur::ComputeUnits::CpuAndGpu;
    case 2: return hastur::ComputeUnits::CpuAndAne;
    case 3: return hastur::ComputeUnits::CpuOnly;
    default: return hastur::ComputeUnits::All;
  }
}

// Read one interleaved pixel to normalized float ([0,1] for int depths).
template <class PIX>
inline void T3ReadPix(const PIX* p, int nc, float scale, float& r, float& g, float& b) {
  r = p[0] * scale;
  g = nc > 1 ? p[1] * scale : r;
  b = nc > 2 ? p[2] * scale : r;
}

// Fill a top-down (row 0 = top) HWC RGB float buffer from an OFX image over its
// bounds. OFX pixels are bottom-up, so top row r maps to OFX y = y2-1-r. (Same
// orientation convention as HasturPlugin::ReadFrameRGBA and the sidecar format:
// the produced masks/boxes are therefore top-down, as ExternalTracks requires.)
template <class PIX>
void T3ReadFrameRGB(OFX::Image* img, const OfxRectI& b, int W, int H, float scale,
                    std::vector<float>& rgb) {
  const int nc = img->getPixelComponents() == OFX::ePixelComponentRGBA ? 4 : 1;
  for (int r = 0; r < H; ++r) {
    const int oy = b.y2 - 1 - r;
    for (int c = 0; c < W; ++c) {
      const int ox = b.x1 + c;
      const PIX* p = static_cast<const PIX*>(img->getPixelAddress(ox, oy));
      float* d = &rgb[(static_cast<size_t>(r) * W + c) * 3];
      if (p) T3ReadPix<PIX>(p, nc, scale, d[0], d[1], d[2]);
      else { d[0] = d[1] = d[2] = 0.f; }
    }
  }
}

// The engine's input geometry + normalization.
constexpr int kIn = hastur::kMImgSize;   // 1008
constexpr int kLR = hastur::kMLowRes;    // 288

// Bilinear-resample a top-down W*H*3 RGB frame to a planar CHW 3*1008*1008 buffer,
// normalized (mean/std 0.5, i.e. 2*v-1) as the SAM 3 engine expects.
void T3ToPlanarCHW(const std::vector<float>& rgb, int W, int H,
                   std::vector<float>& chw) {
  chw.assign(static_cast<size_t>(3) * kIn * kIn, 0.f);
  const size_t plane = static_cast<size_t>(kIn) * kIn;
  for (int ty = 0; ty < kIn; ++ty) {
    float gy = (ty + 0.5f) * (static_cast<float>(H) / kIn) - 0.5f;
    if (gy < 0.f) gy = 0.f;
    if (gy > H - 1.f) gy = H - 1.f;
    const int y0 = static_cast<int>(gy);
    const int y1 = std::min(y0 + 1, H - 1);
    const float wy = gy - y0;
    for (int tx = 0; tx < kIn; ++tx) {
      float gx = (tx + 0.5f) * (static_cast<float>(W) / kIn) - 0.5f;
      if (gx < 0.f) gx = 0.f;
      if (gx > W - 1.f) gx = W - 1.f;
      const int x0 = static_cast<int>(gx);
      const int x1 = std::min(x0 + 1, W - 1);
      const float wx = gx - x0;
      const size_t o = static_cast<size_t>(ty) * kIn + tx;
      for (int c = 0; c < 3; ++c) {
        const float v00 = rgb[(static_cast<size_t>(y0) * W + x0) * 3 + c];
        const float v01 = rgb[(static_cast<size_t>(y0) * W + x1) * 3 + c];
        const float v10 = rgb[(static_cast<size_t>(y1) * W + x0) * 3 + c];
        const float v11 = rgb[(static_cast<size_t>(y1) * W + x1) * 3 + c];
        const float top = v00 + (v01 - v00) * wx;
        const float bot = v10 + (v11 - v10) * wx;
        const float v = top + (bot - top) * wy;
        chw[c * plane + o] = 2.f * v - 1.f;  // mean/std 0.5 normalization
      }
    }
  }
}

// IoU of a binary detection mask (288) against a track's low-res logits (>0).
// Ported verbatim from validate_bidir.cpp.
double T3IouBinLogit(const std::vector<uint8_t>& det, const std::vector<float>& trk) {
  long inter = 0, uni = 0;
  for (int i = 0; i < kLR * kLR; ++i) {
    int a = det[i], bb = (i < static_cast<int>(trk.size()) && trk[i] > 0.f) ? 1 : 0;
    inter += (a & bb);
    uni += (a | bb);
  }
  return uni ? static_cast<double>(inter) / uni : 0.0;
}

#endif  // HASTUR_WITH_ONNX

}  // namespace

////////////////////////////////////////////////////////////////////////////////

