samhodge-tokgan/Hastur/src/Sam3TrackerPlugin.cpp
class Sam3TrackerPlugin : public OFX::ImageEffect {
 public:
  explicit Sam3TrackerPlugin(OfxImageEffectHandle handle) : OFX::ImageEffect(handle) {
    _dstClip = fetchClip(kOfxImageEffectOutputClipName);
    _srcClip = fetchClip(kOfxImageEffectSimpleSourceClipName);
    _modelDir = fetchStringParam(kT3ParamModelDir);
    _tracksOutputDir = fetchStringParam(kT3ParamTracksOutputDir);
    _seedFrame = fetchIntParam(kT3ParamSeedFrame);
    _bidirectional = fetchBooleanParam(kT3ParamBidirectional);
    _scoreThresh = fetchDoubleParam(kT3ParamScoreThresh);
    _nmsIou = fetchDoubleParam(kT3ParamNmsIou);
    _computeUnits = fetchChoiceParam(kT3ParamComputeUnits);
  }

  void render(const OFX::RenderArguments& args) override;

 private:
  void renderPassthrough(const OFX::RenderArguments& args);
#if HASTUR_WITH_ONNX
  // The whole-clip pre-pass; writes the sidecar. Returns true on success (or when
  // there was genuinely nothing to do). Guarded by _prepassMx + _done.
  bool runPrepass(const OFX::RenderArguments& args);
  std::string PrepassSignature() const;
#endif

  OFX::Clip* _dstClip = nullptr;
  OFX::Clip* _srcClip = nullptr;
  OFX::StringParam* _modelDir = nullptr;
  OFX::StringParam* _tracksOutputDir = nullptr;
  OFX::IntParam* _seedFrame = nullptr;
  OFX::BooleanParam* _bidirectional = nullptr;
  OFX::DoubleParam* _scoreThresh = nullptr;
  OFX::DoubleParam* _nmsIou = nullptr;
  OFX::ChoiceParam* _computeUnits = nullptr;

  std::mutex _prepassMx;
  bool _done = false;
  std::string _sig;
};

////////////////////////////////////////////////////////////////////////////////

void Sam3TrackerPlugin::renderPassthrough(const OFX::RenderArguments& args) {
  std::unique_ptr<OFX::Image> dst(_dstClip->fetchImage(args.time));
  if (!dst.get()) OFX::throwSuiteStatusException(kOfxStatFailed);
  const OFX::BitDepthEnum bd = dst->getPixelDepth();
  const OFX::PixelComponentEnum comp = dst->getPixelComponents();
  std::unique_ptr<OFX::Image> src(
      _srcClip && _srcClip->isConnected() ? _srcClip->fetchImage(args.time) : nullptr);

  auto run = [&](T3CopyBase& p) {
    p.setSrcImg(src.get());
    p.setDstImg(dst.get());
    p.setRenderWindow(args.renderWindow);
    p.process();
  };
  if (comp == OFX::ePixelComponentRGBA) {
    if (bd == OFX::eBitDepthFloat) { T3CopyProcessor<float, 4> p(*this); run(p); }
    else if (bd == OFX::eBitDepthUShort) { T3CopyProcessor<unsigned short, 4> p(*this); run(p); }
    else { T3CopyProcessor<unsigned char, 4> p(*this); run(p); }
  } else {
    if (bd == OFX::eBitDepthFloat) { T3CopyProcessor<float, 1> p(*this); run(p); }
    else if (bd == OFX::eBitDepthUShort) { T3CopyProcessor<unsigned short, 1> p(*this); run(p); }
    else { T3CopyProcessor<unsigned char, 1> p(*this); run(p); }
  }
}

#if HASTUR_WITH_ONNX

std::string Sam3TrackerPlugin::PrepassSignature() const {
  std::string modelDir, tracksOut;
  _modelDir->getValue(modelDir);
  _tracksOutputDir->getValue(tracksOut);
  int seed = -1; _seedFrame->getValue(seed);
  bool bidir = true; _bidirectional->getValue(bidir);
  double score = 0.5, nms = 0.1; _scoreThresh->getValue(score); _nmsIou->getValue(nms);
  int cu = 0; _computeUnits->getValue(cu);
  OfxRangeD fr = _srcClip ? _srcClip->getFrameRange() : OfxRangeD{0, 0};
  char buf[256];
  std::snprintf(buf, sizeof(buf), "|%d|%d|%.4f|%.4f|%d|%.3f..%.3f", seed,
                static_cast<int>(bidir), score, nms, cu, fr.min, fr.max);
  return modelDir + "|" + tracksOut + buf;
}

bool Sam3TrackerPlugin::runPrepass(const OFX::RenderArguments& args) {
  namespace fs = std::filesystem;
  using hastur::Sam3MultiTracker;

  // ---- guard: run once per (params/clip/frame-range) signature ----
  const std::string sig = PrepassSignature();
  std::lock_guard<std::mutex> lk(_prepassMx);
  if (_done && sig == _sig) return true;

  if (!_srcClip || !_srcClip->isConnected()) return false;

  // ---- params ----
  std::string modelDirParam, tracksOut;
  _modelDir->getValue(modelDirParam);
  _tracksOutputDir->getValue(tracksOut);
  int seedParam = -1; _seedFrame->getValue(seedParam);
  bool bidir = true; _bidirectional->getValue(bidir);
  double dScore = 0.5, dNms = 0.1;
  _scoreThresh->getValue(dScore); _nmsIou->getValue(dNms);
  const float scoreThresh = static_cast<float>(dScore);
  const float nmsIou = static_cast<float>(dNms);
  int cu = 0; _computeUnits->getValue(cu);
  if (tracksOut.empty()) {
    std::fprintf(stderr, "[Sam3Tracker] tracksOutputDir is empty; nothing to write\n");
    return false;
  }

  // ---- clip frame range (kOfxImageEffectPropFrameRange via the Source clip) ----
  OfxRangeD fr = _srcClip->getFrameRange();
  long t0 = std::lround(fr.min), t1 = std::lround(fr.max);
  if (t1 < t0) { double a, b; timeLineGetBounds(a, b); t0 = std::lround(a); t1 = std::lround(b); }
  if (t1 < t0) return false;
  const int N = static_cast<int>(t1 - t0 + 1);

  // ---- lazily fetch + convert a frame (idx 0..N-1 -> time t0+idx) to planar CHW.
  // Cached for the whole pre-pass so each frame is fetched at most once even though
  // the scan / forward / backward passes each revisit frames. plateW/plateH are
  // captured from the first successful fetch (all frames assumed same size). ----
  std::unordered_map<int, std::vector<float>> cache;
  int plateW = 0, plateH = 0;
  auto getFrame = [&](int idx) -> const std::vector<float>* {
    auto it = cache.find(idx);
    if (it != cache.end()) return it->second.empty() ? nullptr : &it->second;
    std::vector<float>& slot = cache[idx];  // inserts empty
    std::unique_ptr<OFX::Image> img(_srcClip->fetchImage(static_cast<double>(t0 + idx)));
    if (!img.get()) return nullptr;
    const OfxRectI b = img->getBounds();
    const int W = b.x2 - b.x1, H = b.y2 - b.y1;
    if (W <= 0 || H <= 0) return nullptr;
    if (plateW == 0) { plateW = W; plateH = H; }
    std::vector<float> rgb(static_cast<size_t>(W) * H * 3, 0.f);
    const OFX::BitDepthEnum bd = img->getPixelDepth();
    if (bd == OFX::eBitDepthFloat) T3ReadFrameRGB<float>(img.get(), b, W, H, 1.f, rgb);
    else if (bd == OFX::eBitDepthUShort) T3ReadFrameRGB<unsigned short>(img.get(), b, W, H, 1.f / 65535.f, rgb);
    else T3ReadFrameRGB<unsigned char>(img.get(), b, W, H, 1.f / 255.f, rgb);
    T3ToPlanarCHW(rgb, W, H, slot);
    return &slot;
  };

