samhodge-tokgan/Hastur/src/Sam3TrackerPlugin.cpp
  // ---- build the engine (loads G1..G5 + constants). Throws on missing assets;
  // the caller catches and falls back to passthrough. ----
  hastur::Ep ep = hastur::Ep::Auto;
  hastur::MultiPaths paths = T3BuildPaths(T3ResolveModelDir(modelDirParam));
  Sam3MultiTracker eng(paths, ep, T3ChoiceToUnits(cu));
  std::fprintf(stderr,
               "[Sam3Tracker] pre-pass: frames %ld..%ld (N=%d) accel=%d "
               "score=%.3f nms=%.3f bidir=%d\n",
               t0, t1, N, static_cast<int>(eng.accelerator_active()), scoreThresh,
               nmsIou, static_cast<int>(bidir));

  // ---- determine the seed frame (idx space). -1 => auto max-visibility: the
  // frame whose detections cover the most area (a scan of BeginFrame+Detect). ----
  const int autoScan = (seedParam < 0) ? N : 0;
  int SEED = 0;
  if (seedParam >= 0) {
    SEED = static_cast<int>(std::lround(seedParam - t0));
    if (SEED < 0) SEED = 0;
    if (SEED > N - 1) SEED = N - 1;
  }

  // ---- progress: scan (optional) + seed + forward + backward ----
  const int forwardCount = (N - 1) - SEED;  // provisional; recomputed after auto seed
  int total = autoScan + 1 + std::max(0, N - 1) + (bidir ? N : 0);
  if (total < 1) total = 1;
  int stepDone = 0;
  progressStart("SAM 3 Tracker: tracking clip (whole-clip pre-pass)");
  auto tick = [&]() -> bool {
    ++stepDone;
    return progressUpdate(static_cast<double>(stepDone) / total);
  };

  if (autoScan) {
    double best = -1.0;
    for (int f = 0; f < N; ++f) {
      if (abort()) { progressEnd(); return false; }
      const std::vector<float>* chw = getFrame(f);
      if (chw) {
        eng.BeginFrame(chw->data(), f, N);
        auto dets = eng.Detect(scoreThresh, nmsIou);
        double vis = 0.0;
        for (auto& d : dets) vis += static_cast<double>(d.area);
        std::fprintf(stderr, "  scan %3d/%d: %zu dets, vis=%.0f\n", f + 1, N,
                     dets.size(), vis);
        if (vis > best) { best = vis; SEED = f; }
      }
      if (!tick()) { progressEnd(); return false; }
    }
    std::fprintf(stderr, "[Sam3Tracker] auto seed frame = %d (idx), plate=%ld\n",
                 SEED, t0 + SEED);
  }
  (void)forwardCount;

  // ---- driver state (mirrors validate_bidir.cpp) ----
  std::vector<Sam3MultiTracker::ObjState> tracks;
  int next_id = 0;
  const float NEW_DET = hastur::kNewDetThresh;   // 0.7
  const float ASSOC = hastur::kAssocIou;         // 0.1
  const float TRK_ASSOC = hastur::kTrkAssocIou;  // 0.5
  const int PRUNE_UNMATCHED = 8;

  // STREAM each frame's 1008² mask to disk the instant the frame is finalized (every
  // frame is recorded exactly once — seed, then forward, then backward passes). This
  // keeps the tracker's peak memory O(active tracks) instead of O(clip × tracks): the
  // old code buffered every frame's mask (~4 MB each) in RAM until the end — ~21 GB on
  // a 352-frame, 15-track clip — which is what capped resolution and clip length. We
  // now retain only a tiny per-mask bbox row (kIn space; scaled to plate px when
  // tracks.txt is written at the end). Directory must exist before the first record.
  const fs::path sdir(tracksOut);
  const fs::path mdir = sdir / "masks";
  { std::error_code ec; fs::create_directories(mdir, ec); }
  struct MaskRow { long frame; int id; int x0, y0, x1, y1; std::string rel; };
  std::vector<MaskRow> track_rows;
  auto write_mask = [&](long frame, int id, const std::vector<float>& hi) {
    if (static_cast<int>(hi.size()) < kIn * kIn) return;
    int x0 = kIn, y0 = kIn, x1 = -1, y1 = -1;
    std::vector<uint8_t> cov(static_cast<size_t>(kIn) * kIn, 0);
    for (int y = 0; y < kIn; ++y)
      for (int x = 0; x < kIn; ++x) {
        const size_t idx = static_cast<size_t>(y) * kIn + x;
        // last_high = G4's pred_masks_high_res, sigmoid-ed to [0,1]; write soft 0..255
        // coverage at full 1008² (Hastur maps uint8/255 -> coverage). bbox = 0.5 iso.
        float p = hi[idx];
        if (p < 0.f) p = 0.f; else if (p > 1.f) p = 1.f;
        cov[idx] = static_cast<uint8_t>(p * 255.f + 0.5f);
        if (p > 0.5f) { x0 = std::min(x0, x); y0 = std::min(y0, y);
                        x1 = std::max(x1, x); y1 = std::max(y1, y); }
      }
    if (x1 < 0) return;  // empty mask -> no file/row
    char rel[64];
    std::snprintf(rel, sizeof(rel), "masks/%04ld_%02d.msk", frame, id);
    std::ofstream mk(sdir / rel, std::ios::binary | std::ios::trunc);
    if (mk) {
      mk.write("MSK1", 4);
      int32_t mw = kIn, mh = kIn;
      mk.write(reinterpret_cast<const char*>(&mw), 4);
      mk.write(reinterpret_cast<const char*>(&mh), 4);
      mk.write(reinterpret_cast<const char*>(cov.data()),
               static_cast<std::streamsize>(cov.size()));
    }
    track_rows.push_back({frame, id, x0, y0, x1, y1, std::string(rel)});
  };
  auto record_frame = [&](int f) {
    const long plate = t0 + f;
    for (auto& t : tracks) {
      if (!t.active || t.last_area <= 0) continue;
      write_mask(plate, t.id, t.last_high);  // streams to disk; only a bbox row is kept
    }
  };

  // one detect->associate->spawn/prune step on the current (already-BeginFrame'd)
  // frame — ported verbatim from validate_bidir.cpp's process_frame.
  auto process_frame = [&](int f, bool reverse) {
    for (auto& t : tracks) if (t.active) eng.PropagateObj(t, reverse);
    auto dets = eng.Detect(scoreThresh, nmsIou);
    const int M = static_cast<int>(tracks.size());
    const int D = static_cast<int>(dets.size());
    std::vector<double> trk_best(M, 0.0), det_best(D, 0.0);
    for (int di = 0; di < D; ++di)
      for (int ti = 0; ti < M; ++ti) {
        if (!tracks[ti].active) continue;
        double j = T3IouBinLogit(dets[di].bin288, tracks[ti].last_low);
        if (j > det_best[di]) det_best[di] = j;
        if (j > trk_best[ti]) trk_best[ti] = j;
      }
    int pruned = 0;
    for (int ti = 0; ti < M; ++ti) {
      if (!tracks[ti].active) continue;
      if (trk_best[ti] >= TRK_ASSOC) tracks[ti].last_match = f;
      else if (std::abs(f - tracks[ti].last_match) >= PRUNE_UNMATCHED) {
        tracks[ti].active = false; ++pruned;
      }
    }
    int spawned = 0;
    for (int di = 0; di < D; ++di) {
      if (dets[di].score >= NEW_DET && det_best[di] < ASSOC) {
        Sam3MultiTracker::ObjState t; t.id = next_id++;
        eng.SeedObj(t, dets[di].soft1008.data());
        tracks.push_back(std::move(t));
        ++spawned;
      }
    }
    int nactive = 0; for (auto& t : tracks) if (t.active) ++nactive;
    std::fprintf(stderr, "  frame %3d (%s): %d dets, %d active (spawn=%d prune=%d)\n",
                 f, reverse ? "bwd" : "fwd", D, nactive, spawned, pruned);
  };

  // ---- seed all detections at the seed frame ----
  {
    const std::vector<float>* chw = getFrame(SEED);
    if (!chw) { progressEnd(); return false; }
    eng.BeginFrame(chw->data(), SEED, N);
    auto dets0 = eng.Detect(scoreThresh, nmsIou);
    std::fprintf(stderr, "[Sam3Tracker] seed frame %d: %zu dets -> seed\n", SEED,
                 dets0.size());
    for (auto& d : dets0) {
      Sam3MultiTracker::ObjState t; t.id = next_id++;
      eng.SeedObj(t, d.soft1008.data());
      tracks.push_back(std::move(t));
    }
    record_frame(SEED);
  }
  if (!tick()) { progressEnd(); return false; }

  // snapshot the seed-frame states for the backward pass (forward mutates tracks).
  std::vector<Sam3MultiTracker::ObjState> seed_snapshot = tracks;
  const int seed_next_id = next_id;

  // ---- FORWARD pass: seed+1 .. N-1 ----
  std::fprintf(stderr, "[Sam3Tracker] forward pass %d -> %d\n", SEED + 1, N - 1);
  for (int f = SEED + 1; f < N; ++f) {
    if (abort()) { progressEnd(); return false; }
    const std::vector<float>* chw = getFrame(f);
    if (chw) { eng.BeginFrame(chw->data(), f, N); process_frame(f, /*reverse=*/false); record_frame(f); }
    std::fprintf(stderr, "[Sam3Tracker] forward %d/%d\n", f - SEED, std::max(1, N - 1 - SEED));
    if (!tick()) { progressEnd(); return false; }
  }

  // ---- BACKWARD pass: restore snapshot, seed-1 .. 0 (only when bidirectional) ----
  if (bidir) {
    tracks = seed_snapshot;
    next_id = seed_next_id;  // backward-spawned objects continue the id counter
    std::fprintf(stderr, "[Sam3Tracker] backward pass %d -> %d\n", SEED - 1, 0);
    for (int f = SEED - 1; f >= 0; --f) {
      if (abort()) { progressEnd(); return false; }
      const std::vector<float>* chw = getFrame(f);
      if (chw) { eng.BeginFrame(chw->data(), f, N); process_frame(f, /*reverse=*/true); record_frame(f); }
      std::fprintf(stderr, "[Sam3Tracker] backward %d/%d\n", SEED - f, std::max(1, SEED));
      if (!tick()) { progressEnd(); return false; }
    }
  }

