samhodge-tokgan/Hastur/src/Sam3TrackerPlugin.cpp
  progressUpdate(1.0);
  progressEnd();

  if (plateW == 0 || plateH == 0) {
    std::fprintf(stderr, "[Sam3Tracker] no frames fetched; sidecar not written\n");
    return false;
  }

  // ---- masks already streamed to disk during the passes; write tracks.txt ----
  // (sdir/mdir were created before the passes, above.) Distinct ids actually recorded,
  // sorted — the "# ids" header enumerates every track id so a full Cryptomatte manifest
  // can be baked downstream.
  std::vector<int> ids;
  for (auto& r : track_rows) ids.push_back(r.id);
  std::sort(ids.begin(), ids.end());
  ids.erase(std::unique(ids.begin(), ids.end()), ids.end());

  std::ofstream tt(sdir / "tracks.txt", std::ios::binary | std::ios::trunc);
  if (!tt) {
    std::fprintf(stderr, "[Sam3Tracker] cannot open %s/tracks.txt for write\n",
                 sdir.string().c_str());
    return false;
  }
  tt << "# hastur-tracks v1\n";
  tt << "# ids"; for (int id : ids) tt << " " << id; tt << "\n";
  tt << "# frame track_id x0 y0 x1 y1 mask_relpath\n";

  const float sx = static_cast<float>(plateW) / kIn;  // bbox mask-space (kIn) -> plate px
  const float sy = static_cast<float>(plateH) / kIn;
  for (auto& r : track_rows)
    tt << r.frame << " " << r.id << " " << (r.x0 * sx) << " " << (r.y0 * sy) << " "
       << ((r.x1 + 1) * sx) << " " << ((r.y1 + 1) * sy) << " " << r.rel << "\n";
  tt.flush();
  std::fprintf(stderr,
               "[Sam3Tracker] wrote %s/tracks.txt (%zu rows, %zu ids) + masks/\n",
               sdir.string().c_str(), track_rows.size(), ids.size());

  _done = true;
  _sig = sig;
  return true;
}

#endif  // HASTUR_WITH_ONNX

void Sam3TrackerPlugin::render(const OFX::RenderArguments& args) {
#if HASTUR_WITH_ONNX
  // FIRST render call (per signature) runs the whole-clip pre-pass that writes the
  // sidecar. Any failure degrades to a plain passthrough — never crash the host.
  try {
    runPrepass(args);
  } catch (const std::exception& e) {
    hasturreg::SafeSetMessage(*this, OFX::Message::eMessageError, "sam3TrackerPrepass",
                              std::string("SAM 3 Tracker pre-pass error: ") + e.what());
  } catch (...) {
    hasturreg::SafeSetMessage(*this, OFX::Message::eMessageError, "sam3TrackerPrepass",
                              "SAM 3 Tracker pre-pass error (unknown)");
  }
#endif
  // On EVERY render (including the first, after the pre-pass) pass Source through
  // to Output unchanged — the node's product is the sidecar, not a new image.
  renderPassthrough(args);
}

////////////////////////////////////////////////////////////////////////////////

// Explicit factory. This node is NOT multi-plane, so it uses the Support library's
// default per-factory main entry (no getMainEntry override / no action intercept).
class Sam3TrackerFactory : public OFX::PluginFactoryHelper<Sam3TrackerFactory> {
 public:
  Sam3TrackerFactory(const std::string& id, unsigned int verMaj, unsigned int verMin)
      : OFX::PluginFactoryHelper<Sam3TrackerFactory>(id, verMaj, verMin) {}
  void load() override {}
  void unload() override {}
  void describe(OFX::ImageEffectDescriptor& desc) override;
  void describeInContext(OFX::ImageEffectDescriptor& desc,
                         OFX::ContextEnum context) override;
  OFX::ImageEffect* createInstance(OfxImageEffectHandle handle,
                                   OFX::ContextEnum /*context*/) override {
    return new Sam3TrackerPlugin(handle);
  }
};

using namespace OFX;

void Sam3TrackerFactory::describe(OFX::ImageEffectDescriptor& desc) {
  desc.setLabels(kT3PluginName, kT3PluginName, kT3PluginName);
  desc.setPluginGrouping(kT3PluginGrouping);
  desc.setPluginDescription(kT3PluginDescription);

  desc.addSupportedContext(eContextFilter);
  desc.addSupportedContext(eContextGeneral);
  desc.addSupportedBitDepth(eBitDepthFloat);
  desc.addSupportedBitDepth(eBitDepthUByte);
  desc.addSupportedBitDepth(eBitDepthUShort);

  desc.setSingleInstance(false);
  desc.setHostFrameThreading(false);
  // STATEFUL whole-clip pre-pass: forbid the host from cloning/parallelizing this
  // effect. The default (fully-safe) lets Natron 2.5 spawn per-frame render clones —
  // and since each clone re-runs the ENTIRE first-render pre-pass (SAM 3 whole-clip
  // tracking) that is a huge duplicated GPU cost + OOM risk. Unsafe = one render call
  // at a time on the ORIGINAL instance only, no clones (one pre-pass, one engine).
  desc.setRenderThreadSafety(OFX::eRenderUnsafe);
  desc.setSupportsMultiResolution(true);
  desc.setSupportsTiles(false);            // the pre-pass needs whole frames
  // The node reads the WHOLE clip in its render pre-pass: temporal clip access at
  // the effect (and, in describeInContext, the Source clip).
  desc.setTemporalClipAccess(true);
  desc.setRenderTwiceAlways(false);
  desc.setSupportsMultipleClipPARs(false);
}

void Sam3TrackerFactory::describeInContext(OFX::ImageEffectDescriptor& desc,
                                           OFX::ContextEnum /*context*/) {
  ClipDescriptor* src = desc.defineClip(kOfxImageEffectSimpleSourceClipName);
  src->addSupportedComponent(ePixelComponentRGBA);
  src->setTemporalClipAccess(true);        // the node reads the whole clip
  src->setSupportsTiles(false);
  src->setIsMask(false);

  ClipDescriptor* dst = desc.defineClip(kOfxImageEffectOutputClipName);
  dst->addSupportedComponent(ePixelComponentRGBA);
  dst->setSupportsTiles(false);

  PageParamDescriptor* page = desc.definePageParam("Controls");

  {
    StringParamDescriptor* p = desc.defineStringParam(kT3ParamModelDir);
    p->setLabels("Model dir", "Model dir", "Model directory");
    p->setHint("Directory holding the 5 SAM 3 tracker ONNX graphs (G1.onnx..G5.onnx) "
               "and the .npy constants (const_maskmem_tpos_enc, const_no_mem_embed, "
               "const_objptr_tpos_proj_w/b, const_lang_feats_person, "
               "const_lang_mask_person). Empty resolves from $HASTUR_MODEL_DIR then "
               "the bundle Contents/Resources.");
    p->setStringType(eStringTypeDirectoryPath);
    p->setDefault("");
    page->addChild(*p);
  }
  {
    StringParamDescriptor* p = desc.defineStringParam(kT3ParamTracksOutputDir);
    p->setLabels("Tracks output dir", "Tracks out", "Tracks output directory");
    p->setHint("Directory to WRITE the external-tracks sidecar into: tracks.txt "
               "(the Hastur external-tracks format) plus masks/<frame>_<id>.msk "
               "coverage. Point Hastur's SAM 3D Body 'Person tracks' param at this "
               "same directory to drive its pose from these boxes+ids.");
    p->setStringType(eStringTypeDirectoryPath);
    p->setDefault("");
    page->addChild(*p);
  }
  {
    IntParamDescriptor* p = desc.defineIntParam(kT3ParamSeedFrame);
    p->setLabels("Seed frame", "Seed frame", "Seed frame");
    p->setHint("Frame to seed all tracks from before propagating both ways. -1 = "
               "auto: pick the max-visibility frame (largest total detection area). "
               "Given as a plate frame number.");
    p->setRange(-1, 1000000);
    p->setDisplayRange(-1, 1000);
    p->setDefault(-1);
    page->addChild(*p);
  }
  {
    BooleanParamDescriptor* p = desc.defineBooleanParam(kT3ParamBidirectional);
    p->setLabels("Bidirectional", "Bidirectional", "Bidirectional");
    p->setHint("Propagate from the seed frame BOTH forward (seed->end) and backward "
               "(seed->start). Off = forward only (frames before the seed get no "
               "tracks).");
    p->setDefault(true);
    page->addChild(*p);
  }
  {
    DoubleParamDescriptor* p = desc.defineDoubleParam(kT3ParamScoreThresh);
    p->setLabels("Score threshold", "Score thresh", "Detection score threshold");
    p->setHint("Per-frame detection score threshold (sigmoid*presence) fed to the "
               "SAM 3 detector head before mask-IoU NMS.");
    p->setRange(0.0, 1.0);
    p->setDisplayRange(0.0, 1.0);
    p->setDefault(0.5);
    page->addChild(*p);
  }
  {
    DoubleParamDescriptor* p = desc.defineDoubleParam(kT3ParamNmsIou);
    p->setLabels("NMS IoU", "NMS IoU", "Detection NMS IoU");
    p->setHint("Mask-IoU threshold for non-max suppression of per-frame detections.");
    p->setRange(0.0, 1.0);
    p->setDisplayRange(0.0, 1.0);
    p->setDefault(0.1);
    page->addChild(*p);
  }
  {
    ChoiceParamDescriptor* p = desc.defineChoiceParam(kT3ParamComputeUnits);
    p->setLabels("Compute units", "Compute units", "Compute units");
    p->setHint("ONNX Runtime accelerator selection (CoreML MLComputeUnits on macOS; "
               "CUDA elsewhere).");
    p->appendOption("All");
    p->appendOption("CPU + GPU");
    p->appendOption("CPU + Neural Engine");
    p->appendOption("CPU only");
    p->setDefault(0);
    page->addChild(*p);
  }
}

// Appended to the bundle's plugin list from OFX::Plugin::getPluginIDs so the
// bundle exports a THIRD plugin (Sam3dBody + MattePartition + Sam3Tracker),
// i.e. OfxGetNumberOfPlugins() == 3. Defined out-of-line (declared in Register.h).
namespace hasturreg {
void AppendSam3Tracker(OFX::PluginFactoryArray& ids) {
  static Sam3TrackerFactory f(kT3PluginIdentifier, kT3PluginVersionMajor,
                              kT3PluginVersionMinor);
  ids.push_back(&f);
}
}  // namespace hasturreg
